kslabs/BMI30.stm32h7/USB_DEVICE/App/usbd_cdc_custom.c
/* Логирование Vendor: для максимальной производительности по умолчанию выключено. */
#ifndef USBD_VND_LOG_ENABLE
#define USBD_VND_LOG_ENABLE 0
#endif
#if USBD_VND_LOG_ENABLE
#define VND_LOGF(...) printf(__VA_ARGS__)
#else
#define VND_LOGF(...) do{}while(0)
#endif

/*
 * usbd_cdc_custom.c
 * Объединённый класс: стандартный CDC (2 интерфейса) + дополнительный Vendor Bulk интерфейс.
 * Добавлен 3‑й интерфейс (bNumInterfaces=3) и два конечных точки: EP3 OUT (0x03), EP3 IN (0x83) Bulk.
 */
#include "usbd_cdc.h"      // для типов и макросов CDC
#include "usbd_ctlreq.h"
#include <stdio.h>
#include "usb_vendor_app.h" // ДОБАВЛЕНО: для VND_CMD_* и vnd_build_status
#include <string.h>
#include "stm32h7xx_hal.h"  // для SCB_CleanDCache_by_Addr (H7, D-Cache)

#ifndef USBD_CDC_USERDATA_INDEX
#define USBD_CDC_USERDATA_INDEX 0
#endif
#define CDC_USR(pdev) ((USBD_CDC_ItfTypeDef*)(pdev)->pUserData[USBD_CDC_USERDATA_INDEX])

/* Дополнительные endpoint'ы Vendor */
#define VND_OUT_EP                     0x03U
#define VND_IN_EP                      0x83U
#define VND_DATA_HS_MAX_PACKET_SIZE    512U
#define VND_DATA_FS_MAX_PACKET_SIZE    64U

/* Максимальный размер одного кадра Vendor (32 байта заголовок + до 1024 выборок *2) */
#define VND_MAX_FRAME_SIZE             (32u + 1024u*2u) /* =2080 */

/*
 * Конфигурационный дескриптор: добавляем Vendor IF#2 с двумя alt-setting:
 *  - alt 0: 0 endpoints (idle)
 *  - alt 1: bulk OUT 0x03, bulk IN 0x83 (stream)
 * Итого: 9 байт (IF alt0) + 9+7+7 байт (IF alt1 + 2 EP) = 32 байта вместо прежних 23.
 */
#ifndef USB_CDC_CONFIG_DESC_SIZ
#warning "Ожидается объявление USB_CDC_CONFIG_DESC_SIZ в usbd_cdc.h"
#define USB_CDC_CONFIG_DESC_SIZ  (67) /* fallback */
#endif
#define USB_CDC_VENDOR_CONFIG_DESC_SIZ (USB_CDC_CONFIG_DESC_SIZ + 40U)

/* Прототипы */
static uint8_t USBD_CDCVND_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx);
static uint8_t USBD_CDCVND_DeInit(USBD_HandleTypeDef *pdev, uint8_t cfgidx);
static uint8_t USBD_CDCVND_Setup(USBD_HandleTypeDef *pdev, USBD_SetupReqTypedef *req);
static uint8_t USBD_CDCVND_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum);
static uint8_t USBD_CDCVND_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum);
static uint8_t USBD_CDCVND_EP0_RxReady(USBD_HandleTypeDef *pdev);
static uint8_t *USBD_CDCVND_GetFSCfgDesc(uint16_t *length);
static uint8_t *USBD_CDCVND_GetHSCfgDesc(uint16_t *length);
static uint8_t *USBD_CDCVND_GetOtherSpeedCfgDesc(uint16_t *length);
static uint8_t *USBD_CDCVND_GetDeviceQualifierDescriptor(uint16_t *length);

/* Флаги фоновых запросов управления (EP0) */
static volatile uint8_t g_req_soft_reset = 0;
static volatile uint8_t g_req_deep_reset = 0;
/* Текущие alt-settings по интерфейсам (нас интересует IF#2) */
static volatile uint8_t g_alt_if2 = 0; /* 0=idle, 1=stream */

/* Внешние зависимости */
extern USBD_HandleTypeDef hUsbDeviceHS;
extern void vnd_pipeline_stop_reset(int deep);
/* Прототип локальной функции, определённой ниже, чтобы избежать implicit declaration */
void USBD_VND_ForceTxIdle(void);

/* Простейшие буферы Vendor (нужны до VND_Class_*Reset) */
static uint8_t vnd_rx_buf[VND_DATA_HS_MAX_PACKET_SIZE];
static uint8_t vnd_tx_buf[VND_MAX_FRAME_SIZE];
static volatile uint32_t vnd_rx_len = 0;
static volatile uint8_t vnd_tx_busy = 0;
static volatile uint8_t vnd_last_tx_rc = 0xFF; /* последний rc из USBD_LL_Transmit */
static volatile uint16_t vnd_last_tx_len = 0;

/* Запросить soft/deep reset откуда угодно (в т.ч. из приложения) */
void USBD_VND_RequestSoftReset(void){ g_req_soft_reset = 1; }
void USBD_VND_RequestDeepReset(void){ g_req_deep_reset = 1; }

/* Выполнить мягкий/глубокий ресет класса Vendor (без ре-энумерации USB) */
static void VND_Class_SoftReset(USBD_HandleTypeDef *pdev)
{
  /* Снять занятость, очистить возможные STALL, флешнуть FIFO EP */
  USBD_VND_ForceTxIdle();
  (void)USBD_LL_FlushEP(pdev, VND_IN_EP);
  (void)USBD_LL_FlushEP(pdev, VND_OUT_EP);
  (void)USBD_LL_ClearStallEP(pdev, VND_IN_EP);
  (void)USBD_LL_ClearStallEP(pdev, VND_OUT_EP);
  /* Реарм приёма */
  if (g_alt_if2 == 1) {
    if (pdev->dev_speed == USBD_SPEED_HIGH)
      (void)USBD_LL_PrepareReceive(pdev, VND_OUT_EP, vnd_rx_buf, VND_DATA_HS_MAX_PACKET_SIZE);
    else
      (void)USBD_LL_PrepareReceive(pdev, VND_OUT_EP, vnd_rx_buf, VND_DATA_FS_MAX_PACKET_SIZE);
  }
  /* Остановить и очистить пайплайн приложения */
  vnd_pipeline_stop_reset(0);
}

static void VND_Class_DeepReset(USBD_HandleTypeDef *pdev)
{
  /* Закрыть и переоткрыть конечные точки Vendor */
  (void)USBD_LL_CloseEP(pdev, VND_IN_EP);  pdev->ep_in[VND_IN_EP & 0x0FU].is_used = 0U;
  (void)USBD_LL_CloseEP(pdev, VND_OUT_EP); pdev->ep_out[VND_OUT_EP & 0x0FU].is_used = 0U;
  if (g_alt_if2 == 1) {
    if (pdev->dev_speed == USBD_SPEED_HIGH) {
      (void)USBD_LL_OpenEP(pdev, VND_IN_EP,  USBD_EP_TYPE_BULK, VND_DATA_HS_MAX_PACKET_SIZE);
      pdev->ep_in[VND_IN_EP & 0x0FU].is_used = 1U;
      (void)USBD_LL_OpenEP(pdev, VND_OUT_EP, USBD_EP_TYPE_BULK, VND_DATA_HS_MAX_PACKET_SIZE);
      pdev->ep_out[VND_OUT_EP & 0x0FU].is_used = 1U;
    } else {
      (void)USBD_LL_OpenEP(pdev, VND_IN_EP,  USBD_EP_TYPE_BULK, VND_DATA_FS_MAX_PACKET_SIZE);
      pdev->ep_in[VND_IN_EP & 0x0FU].is_used = 1U;
      (void)USBD_LL_OpenEP(pdev, VND_OUT_EP, USBD_EP_TYPE_BULK, VND_DATA_FS_MAX_PACKET_SIZE);
      pdev->ep_out[VND_OUT_EP & 0x0FU].is_used = 1U;
    }
    /* Реарм приёма */
    if (pdev->dev_speed == USBD_SPEED_HIGH)
      (void)USBD_LL_PrepareReceive(pdev, VND_OUT_EP, vnd_rx_buf, VND_DATA_HS_MAX_PACKET_SIZE);
    else
      (void)USBD_LL_PrepareReceive(pdev, VND_OUT_EP, vnd_rx_buf, VND_DATA_FS_MAX_PACKET_SIZE);
  }
  /* Полная переинициализация пайплайна приложения */
  vnd_pipeline_stop_reset(1);
}

/* Фоновый сервис для исполнения заявок управления */
void USBD_VND_ProcessControlRequests(void)
{
  if (g_req_deep_reset) { g_req_deep_reset = 0; VND_Class_DeepReset(&hUsbDeviceHS); }
  if (g_req_soft_reset) { g_req_soft_reset = 0; VND_Class_SoftReset(&hUsbDeviceHS); }
}

/* Удаляем зависимость от статического дескриптора оригинального файла */
static __ALIGN_BEGIN uint8_t USBD_CDCVND_DeviceQualifierDesc[USB_LEN_DEV_QUALIFIER_DESC] __ALIGN_END = {
  USB_LEN_DEV_QUALIFIER_DESC,
  USB_DESC_TYPE_DEVICE_QUALIFIER,
  0x00, 0x02, /* USB 2.00 */
  0x00, 0x00, 0x00, /* class/subclass/proto (each interface specifies) */
  0x40, /* max packet size for ep0 */
  0x01, /* num configurations */
  0x00
};

/* буферы Vendor уже объявлены выше (для использования в VND_Class_*Reset) */

