kslabs/BMI30.stm32h7/USB_DEVICE/App/usbd_cdc_custom.c
/* Слабый callback для приёма данных Vendor */
__weak void USBD_VND_DataReceived(const uint8_t *data, uint32_t len) { (void)data; (void)len; }

/* Слабый callback завершения передачи Vendor IN */
__weak void USBD_VND_TxCplt(void) {}

/* API для передачи по Vendor */
uint8_t USBD_VND_Transmit(USBD_HandleTypeDef *pdev, const uint8_t *data, uint16_t len)
{
  if (len > (uint16_t)sizeof(vnd_tx_buf)) return (uint8_t)USBD_FAIL; /* недопустимо: кадр больше ожидаемого */
  /* Сначала проверяем занятость; при BUSY — минимальный лог без засорения основного [VND_TX] */
  if (vnd_tx_busy) {
    if (len >= 4) {
      VND_LOGF("[VND_BUSY] ep=0x%02X len=%u head=%02X %02X %02X %02X\r\n", (unsigned)VND_IN_EP, (unsigned)len,
             (unsigned)data[0], (unsigned)data[1], (unsigned)data[2], (unsigned)data[3]);
    } else {
      VND_LOGF("[VND_BUSY] ep=0x%02X len=%u\r\n", (unsigned)VND_IN_EP, (unsigned)len);
    }
    return (uint8_t)USBD_BUSY;
  }
  memcpy(vnd_tx_buf, data, len);
  /* ВАЖНО (STM32H7, включён D-Cache): очистить кэш перед DMA/USB IN,
     иначе хост увидит старые/нулевые данные в памяти. Выравниваем адрес/длину на 32 байта. */
#if defined (SCB_CleanDCache_by_Addr)
  {
    uintptr_t addr = (uintptr_t)vnd_tx_buf;
    uint32_t  clean_addr = (uint32_t)(addr & ~((uintptr_t)31U));
    uint32_t  clean_len  = (uint32_t)(((addr + len + 31U) & ~((uintptr_t)31U)) - clean_addr);
    SCB_CleanDCache_by_Addr((uint32_t*)clean_addr, (int32_t)clean_len);
  }
#endif
  /* Жёсткий запрет STAT mid-stream: если это не рабочий кадр (не 0x5A 0xA5) и идёт стрим, разрешаем только при явном разрешении */
  extern uint8_t streaming; /* из usb_vendor_app.c */
  extern volatile uint8_t vnd_status_permit_once; /* одноразовое разрешение STAT */
  if (streaming) {
    if (!(len >= 2 && vnd_tx_buf[0]==0x5A && vnd_tx_buf[1]==0xA5)) {
      if (vnd_status_permit_once) {
        vnd_status_permit_once = 0; /* использовать разрешение один раз */
      } else {
        /* Блокируем STAT mid-stream */
        /* Лёгкая диагностика блокировки */
        if (len >= 4) {
          VND_LOGF("[VND_BLOCK] ep=0x%02X len=%u head=%02X %02X %02X %02X\r\n", (unsigned)VND_IN_EP, (unsigned)len,
                 (unsigned)vnd_tx_buf[0], (unsigned)vnd_tx_buf[1], (unsigned)vnd_tx_buf[2], (unsigned)vnd_tx_buf[3]);
        } else {
          VND_LOGF("[VND_BLOCK] ep=0x%02X len=%u\r\n", (unsigned)VND_IN_EP, (unsigned)len);
        }
        return (uint8_t)USBD_BUSY;
      }
    }
  }
  vnd_tx_busy = 1U;
  /* ВАЖНО: сообщаем стеку общий размер передачи, чтобы DataIn знал,
    нужно ли отправлять ZLP для длины, кратной размеру пакета, и
    вызывал USBD_VND_TxCplt только ПОСЛЕ полного кадра (после ZLP). */
  pdev->ep_in[VND_IN_EP & 0x0FU].total_length = len;
  vnd_last_tx_len = len;
  vnd_last_tx_rc = (uint8_t)USBD_LL_Transmit(pdev, VND_IN_EP, vnd_tx_buf, len);
  /* Логируем только реально поставленные в LL передачи как [VND_TX] */
  if (vnd_last_tx_rc == (uint8_t)USBD_OK) {
    if (len >= 4) {
      VND_LOGF("[VND_TX] ep=0x%02X len=%u head=%02X %02X %02X %02X\r\n", (unsigned)VND_IN_EP, (unsigned)len,
             (unsigned)vnd_tx_buf[0], (unsigned)vnd_tx_buf[1], (unsigned)vnd_tx_buf[2], (unsigned)vnd_tx_buf[3]);
    } else {
      VND_LOGF("[VND_TX] ep=0x%02X len=%u\r\n", (unsigned)VND_IN_EP, (unsigned)len);
    }
  } else {
    /* Если LL вернул BUSY/FAIL — снимаем флаг занятости и логируем как FAIL */
    vnd_tx_busy = 0U;
    if (len >= 4) {
      VND_LOGF("[VND_FAIL] ep=0x%02X rc=%u len=%u head=%02X %02X %02X %02X\r\n", (unsigned)VND_IN_EP, (unsigned)vnd_last_tx_rc, (unsigned)len,
             (unsigned)vnd_tx_buf[0], (unsigned)vnd_tx_buf[1], (unsigned)vnd_tx_buf[2], (unsigned)vnd_tx_buf[3]);
    } else {
      VND_LOGF("[VND_FAIL] ep=0x%02X rc=%u len=%u\r\n", (unsigned)VND_IN_EP, (unsigned)vnd_last_tx_rc, (unsigned)len);
    }
  }
  return vnd_last_tx_rc;
}

uint32_t USBD_VND_Read(uint8_t *dst, uint32_t max_len)
{
  uint32_t copy = (vnd_rx_len < max_len) ? vnd_rx_len : max_len;
  memcpy(dst, vnd_rx_buf, copy);
  vnd_rx_len = 0; /* помечаем прочитанным */
  return copy;
}

/* Диагностика состояния Vendor IN */
uint8_t USBD_VND_TxIsBusy(void) { return vnd_tx_busy; }
uint8_t USBD_VND_LastTxRC(void) { return vnd_last_tx_rc; }
uint16_t USBD_VND_LastTxLen(void) { return vnd_last_tx_len; }

/* Форсируем свободное состояние TX (использовать осторожно: только при подтверждённом клине) */
void USBD_VND_ForceTxIdle(void)
{
  if (vnd_tx_busy) {
    VND_LOGF("[VND_FORCE_IDLE] clearing busy (last len=%u rc=%u)\r\n", (unsigned)vnd_last_tx_len, (unsigned)vnd_last_tx_rc);
  }
  vnd_tx_busy = 0U;
}

/* Конфигурационные дескрипторы (HS/FS/Other) */
__ALIGN_BEGIN static uint8_t USBD_CDCVND_CfgHSDesc[USB_CDC_VENDOR_CONFIG_DESC_SIZ] __ALIGN_END = {
  /* Configuration Descriptor */
  0x09, USB_DESC_TYPE_CONFIGURATION,
  LOBYTE(USB_CDC_VENDOR_CONFIG_DESC_SIZ), HIBYTE(USB_CDC_VENDOR_CONFIG_DESC_SIZ),
  0x03, /* bNumInterfaces: 3 (2 CDC + 1 Vendor) */
  0x01, 0x00,
#if (USBD_SELF_POWERED == 1U)
  0xC0,
#else
  0x80,
#endif
  USBD_MAX_POWER,
  /* -------- IAD for CDC (IF0+IF1) -------- */
  0x08, 0x0B, 0x00, 0x02, 0x02, 0x02, 0x01, 0x00,
  /* -------- CDC Communication Interface (IF0) -------- */
  0x09, USB_DESC_TYPE_INTERFACE, 0x00, 0x00, 0x01, 0x02, 0x02, 0x01, 0x00,
  /* Header */              0x05, 0x24, 0x00, 0x10, 0x01,
  /* Call Management */     0x05, 0x24, 0x01, 0x00, 0x01,
  /* ACM */                 0x04, 0x24, 0x02, 0x02,
  /* Union */               0x05, 0x24, 0x06, 0x00, 0x01,
  /* CMD EP (Interrupt IN) */
  0x07, USB_DESC_TYPE_ENDPOINT, CDC_CMD_EP, 0x03,
  LOBYTE(CDC_CMD_PACKET_SIZE), HIBYTE(CDC_CMD_PACKET_SIZE), CDC_HS_BINTERVAL,
  /* -------- CDC Data Interface (IF1) -------- */
  0x09, USB_DESC_TYPE_INTERFACE, 0x01, 0x00, 0x02, 0x0A, 0x00, 0x00, 0x00,
  /* OUT EP */ 0x07, USB_DESC_TYPE_ENDPOINT, CDC_OUT_EP, 0x02,
  LOBYTE(CDC_DATA_HS_MAX_PACKET_SIZE), HIBYTE(CDC_DATA_HS_MAX_PACKET_SIZE), 0x00,
  /* IN EP  */ 0x07, USB_DESC_TYPE_ENDPOINT, CDC_IN_EP, 0x02,
  LOBYTE(CDC_DATA_HS_MAX_PACKET_SIZE), HIBYTE(CDC_DATA_HS_MAX_PACKET_SIZE), 0x00,
  /* -------- Vendor Interface (IF2) ALT 0 (idle, 0 EP) -------- */
  0x09, USB_DESC_TYPE_INTERFACE, 0x02, 0x00, 0x00, 0xFF, 0x00, 0x00, 0x05,
  /* -------- Vendor Interface (IF2) ALT 1 (stream, 2 EP) -------- */
  0x09, USB_DESC_TYPE_INTERFACE, 0x02, 0x01, 0x02, 0xFF, 0x00, 0x00, 0x05,
  /* Vendor OUT */ 0x07, USB_DESC_TYPE_ENDPOINT, VND_OUT_EP, 0x02,
  LOBYTE(VND_DATA_HS_MAX_PACKET_SIZE), HIBYTE(VND_DATA_HS_MAX_PACKET_SIZE), 0x00,
  /* Vendor IN  */ 0x07, USB_DESC_TYPE_ENDPOINT, VND_IN_EP, 0x02,
  LOBYTE(VND_DATA_HS_MAX_PACKET_SIZE), HIBYTE(VND_DATA_HS_MAX_PACKET_SIZE), 0x00,
};

