kslabs/BMI30.stm32h7/USB_DEVICE/App/usbd_cdc_custom.c
__ALIGN_BEGIN static uint8_t USBD_CDCVND_CfgFSDesc[USB_CDC_VENDOR_CONFIG_DESC_SIZ] __ALIGN_END = {
  0x09, USB_DESC_TYPE_CONFIGURATION,
  LOBYTE(USB_CDC_VENDOR_CONFIG_DESC_SIZ), HIBYTE(USB_CDC_VENDOR_CONFIG_DESC_SIZ),
  0x03, 0x01, 0x00,
#if (USBD_SELF_POWERED == 1U)
  0xC0,
#else
  0x80,
#endif
  USBD_MAX_POWER,
  /* IAD (IF0+IF1) */ 0x08, 0x0B, 0x00, 0x02, 0x02, 0x02, 0x01, 0x00,
  /* IF0 */ 0x09, USB_DESC_TYPE_INTERFACE, 0x00, 0x00, 0x01, 0x02, 0x02, 0x01, 0x00,
  0x05,0x24,0x00,0x10,0x01,
  0x05,0x24,0x01,0x00,0x01,
  0x04,0x24,0x02,0x02,
  0x05,0x24,0x06,0x00,0x01,
  0x07, USB_DESC_TYPE_ENDPOINT, CDC_CMD_EP, 0x03,
  LOBYTE(CDC_CMD_PACKET_SIZE), HIBYTE(CDC_CMD_PACKET_SIZE), CDC_FS_BINTERVAL,
  /* IF1 */ 0x09, USB_DESC_TYPE_INTERFACE, 0x01, 0x00, 0x02, 0x0A, 0x00, 0x00, 0x00,
  0x07, USB_DESC_TYPE_ENDPOINT, CDC_OUT_EP, 0x02,
  LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE), HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE), 0x00,
  0x07, USB_DESC_TYPE_ENDPOINT, CDC_IN_EP, 0x02,
  LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE), HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE), 0x00,
  /* IF2 Vendor ALT0 */ 0x09, USB_DESC_TYPE_INTERFACE, 0x02, 0x00, 0x00, 0xFF, 0x00, 0x00, 0x05,
  /* IF2 Vendor ALT1 */ 0x09, USB_DESC_TYPE_INTERFACE, 0x02, 0x01, 0x02, 0xFF, 0x00, 0x00, 0x05,
  0x07, USB_DESC_TYPE_ENDPOINT, VND_OUT_EP, 0x02,
  LOBYTE(VND_DATA_FS_MAX_PACKET_SIZE), HIBYTE(VND_DATA_FS_MAX_PACKET_SIZE), 0x00,
  0x07, USB_DESC_TYPE_ENDPOINT, VND_IN_EP, 0x02,
  LOBYTE(VND_DATA_FS_MAX_PACKET_SIZE), HIBYTE(VND_DATA_FS_MAX_PACKET_SIZE), 0x00,
};

__ALIGN_BEGIN static uint8_t USBD_CDCVND_OtherSpeedCfgDesc[USB_CDC_VENDOR_CONFIG_DESC_SIZ] __ALIGN_END = {
  0x09, USB_DESC_TYPE_OTHER_SPEED_CONFIGURATION,
  LOBYTE(USB_CDC_VENDOR_CONFIG_DESC_SIZ), HIBYTE(USB_CDC_VENDOR_CONFIG_DESC_SIZ),
  0x03, 0x01, 0x04,
#if (USBD_SELF_POWERED == 1U)
  0xC0,
#else
  0x80,
#endif
  USBD_MAX_POWER,
  /* IAD (IF0+IF1) */ 0x08, 0x0B, 0x00, 0x02, 0x02, 0x02, 0x01, 0x00,
  /* IF0 */ 0x09, USB_DESC_TYPE_INTERFACE, 0x00, 0x00, 0x01, 0x02, 0x02, 0x01, 0x00,
  0x05,0x24,0x00,0x10,0x01,
  0x05,0x24,0x01,0x00,0x01,
  0x04,0x24,0x02,0x02,
  0x05,0x24,0x06,0x00,0x01,
  0x07, USB_DESC_TYPE_ENDPOINT, CDC_CMD_EP, 0x03,
  LOBYTE(CDC_CMD_PACKET_SIZE), HIBYTE(CDC_CMD_PACKET_SIZE), CDC_FS_BINTERVAL,
  /* IF1 */ 0x09, USB_DESC_TYPE_INTERFACE, 0x01, 0x00, 0x02, 0x0A, 0x00, 0x00, 0x00,
  0x07, USB_DESC_TYPE_ENDPOINT, CDC_OUT_EP, 0x02, 0x40, 0x00, 0x00,
  0x07, USB_DESC_TYPE_ENDPOINT, CDC_IN_EP, 0x02, 0x40, 0x00, 0x00,
  /* IF2 Vendor ALT0 */ 0x09, USB_DESC_TYPE_INTERFACE, 0x02, 0x00, 0x00, 0xFF, 0x00, 0x00, 0x05,
  /* IF2 Vendor ALT1 */ 0x09, USB_DESC_TYPE_INTERFACE, 0x02, 0x01, 0x02, 0xFF, 0x00, 0x00, 0x05,
  0x07, USB_DESC_TYPE_ENDPOINT, VND_OUT_EP, 0x02, 0x40, 0x00, 0x00,
  0x07, USB_DESC_TYPE_ENDPOINT, VND_IN_EP, 0x02, 0x40, 0x00, 0x00,
};

/* Экспортируемая структура класса */
USBD_ClassTypeDef USBD_CDC_VENDOR = {
  USBD_CDCVND_Init,
  USBD_CDCVND_DeInit,
  USBD_CDCVND_Setup,
  NULL,
  USBD_CDCVND_EP0_RxReady,
  USBD_CDCVND_DataIn,
  USBD_CDCVND_DataOut,
  NULL, NULL, NULL,
  USBD_CDCVND_GetHSCfgDesc,
  USBD_CDCVND_GetFSCfgDesc,
  USBD_CDCVND_GetOtherSpeedCfgDesc,
  USBD_CDCVND_GetDeviceQualifierDescriptor,
};

/* ---------------- Реализация коллбэков ---------------- */
static uint8_t USBD_CDCVND_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx)
{
  g_alt_if2 = 0; /* при конфигурации по умолчанию IF2 в alt0 (idle) */
  UNUSED(cfgidx);
  USBD_CDC_HandleTypeDef *hcdc = USBD_malloc(sizeof(USBD_CDC_HandleTypeDef));
  if (!hcdc) { pdev->pClassData = NULL; return (uint8_t)USBD_EMEM; }
  pdev->pClassData = hcdc;

  if (pdev->dev_speed == USBD_SPEED_HIGH) {
    (void)USBD_LL_OpenEP(pdev, CDC_IN_EP,  USBD_EP_TYPE_BULK, CDC_DATA_HS_IN_PACKET_SIZE);
    pdev->ep_in[CDC_IN_EP & 0xFU].is_used = 1U;
    (void)USBD_LL_OpenEP(pdev, CDC_OUT_EP, USBD_EP_TYPE_BULK, CDC_DATA_HS_OUT_PACKET_SIZE);
    pdev->ep_out[CDC_OUT_EP & 0xFU].is_used = 1U;
    pdev->ep_in[CDC_CMD_EP & 0xFU].bInterval = CDC_HS_BINTERVAL;
    /* Vendor IF#2 alt0 по умолчанию — EP будут открыты по SET_INTERFACE(alt=1) */
  } else {
    (void)USBD_LL_OpenEP(pdev, CDC_IN_EP,  USBD_EP_TYPE_BULK, CDC_DATA_FS_IN_PACKET_SIZE);
    pdev->ep_in[CDC_IN_EP & 0xFU].is_used = 1U;
    (void)USBD_LL_OpenEP(pdev, CDC_OUT_EP, USBD_EP_TYPE_BULK, CDC_DATA_FS_OUT_PACKET_SIZE);
    pdev->ep_out[CDC_OUT_EP & 0xFU].is_used = 1U;
    pdev->ep_in[CDC_CMD_EP & 0xFU].bInterval = CDC_FS_BINTERVAL;
    /* Vendor IF#2 alt0 по умолчанию — EP будут открыты по SET_INTERFACE(alt=1) */
  }
  (void)USBD_LL_OpenEP(pdev, CDC_CMD_EP, USBD_EP_TYPE_INTR, CDC_CMD_PACKET_SIZE);
  pdev->ep_in[CDC_CMD_EP & 0xFU].is_used = 1U;

  if (CDC_USR(pdev)) CDC_USR(pdev)->Init();
  hcdc->TxState = 0; hcdc->RxState = 0;

  /* Готовим приём CDC OUT; Vendor OUT готовим только после включения alt1 */
  if (pdev->dev_speed == USBD_SPEED_HIGH) {
    (void)USBD_LL_PrepareReceive(pdev, CDC_OUT_EP, hcdc->RxBuffer, CDC_DATA_HS_OUT_PACKET_SIZE);
  } else {
    (void)USBD_LL_PrepareReceive(pdev, CDC_OUT_EP, hcdc->RxBuffer, CDC_DATA_FS_OUT_PACKET_SIZE);
  }

  /* ОТКЛЮЧЕНО: не отправляем ничего по Vendor IN до явного START_STREAM,
    чтобы не занимать endpoint до того, как хост начнёт читать. */

  /* Диагностический лог скорости USB и maxpacket Vendor IN */
  if(pdev->dev_speed == USBD_SPEED_HIGH){
    VND_LOGF("[VND_INIT] SPEED=HS vnd_mps=%u cdc_in_mps=%u\r\n",
             (unsigned)pdev->ep_in[VND_IN_EP & 0x0FU].maxpacket,
             (unsigned)pdev->ep_in[CDC_IN_EP & 0x0FU].maxpacket);
  } else {
    VND_LOGF("[VND_INIT] SPEED=FS vnd_mps=%u cdc_in_mps=%u\r\n",
             (unsigned)pdev->ep_in[VND_IN_EP & 0x0FU].maxpacket,
             (unsigned)pdev->ep_in[CDC_IN_EP & 0x0FU].maxpacket);
  }

  return (uint8_t)USBD_OK;
}

static uint8_t USBD_CDCVND_DeInit(USBD_HandleTypeDef *pdev, uint8_t cfgidx)
{
  UNUSED(cfgidx);
  (void)USBD_LL_CloseEP(pdev, CDC_IN_EP);  pdev->ep_in[CDC_IN_EP & 0xFU].is_used = 0U;
  (void)USBD_LL_CloseEP(pdev, CDC_OUT_EP); pdev->ep_out[CDC_OUT_EP & 0xFU].is_used = 0U;
  (void)USBD_LL_CloseEP(pdev, CDC_CMD_EP); pdev->ep_in[CDC_CMD_EP & 0xFU].is_used = 0U; pdev->ep_in[CDC_CMD_EP & 0xFU].bInterval = 0U;
  (void)USBD_LL_CloseEP(pdev, VND_IN_EP);  pdev->ep_in[VND_IN_EP & 0xFU].is_used = 0U;
  (void)USBD_LL_CloseEP(pdev, VND_OUT_EP); pdev->ep_out[VND_OUT_EP & 0xFU].is_used = 0U;
  if (pdev->pClassData) {
    if (CDC_USR(pdev)) CDC_USR(pdev)->DeInit();
    USBD_free(pdev->pClassData);
    pdev->pClassData = NULL;
  }
  return (uint8_t)USBD_OK;
}

